 
 const tribunaux = [
  { id: 1, name: "المحكمة الابتدائية بتونس", type: "ابتدائية" },
  { id: 2, name: "المحكمة الابتدائية تونس2", type: "ابتدائية" },
  { id: 3, name: "المحكمة الابتدائية بأريانة", type: "ابتدائية" },
  { id: 4, name: "المحكمة الابتدائية بنعروس", type: "ابتدائية" },
  { id: 5, name: "المحكمة الابتدائية بمنوبة", type: "ابتدائية" },
  { id: 6, name: "المحكمة الابتدائية بقرمبالية", type: "ابتدائية" },
  { id: 7, name: "المحكمة الابتدائية بزغوان", type: "ابتدائية" },
  { id: 8, name: "المحكمة الابتدائية بنابل", type: "ابتدائية" },
  { id: 9, name: "المحكمة الابتدائية ببنزرت", type: "ابتدائية" },
  { id: 10, name: "المحكمة الابتدائية بالكاف", type: "ابتدائية" },
  { id: 11, name: "المحكمة الابتدائية بالقصرين", type: "ابتدائية" },
  { id: 12, name: "المحكمة الابتدائية بسوسة", type: "ابتدائية" },
  { id: 13, name: "المحكمة الابتدائية سوسة2", type: "ابتدائية" },
  { id: 14, name: "المحكمة الابتدائية بالمنستير", type: "ابتدائية" },
  { id: 15, name: "المحكمة الابتدائية بالمهدية", type: "ابتدائية" },
  { id: 16, name: "المحكمة الابتدائية بصفاقس", type: "ابتدائية" },
  { id: 17, name: "المحكمة الابتدائية بصفاقس2", type: "ابتدائية" },
  { id: 18, name: "المحكمة الابتدائية بقفصة", type: "ابتدائية" },
  { id: 19, name: "المحكمة الابتدائية بتوزر", type: "ابتدائية" },
  { id: 20, name: "المحكمة الابتدائية بقابس", type: "ابتدائية" },
  { id: 21, name: "المحكمة الابتدائية بقبلي", type: "ابتدائية" },
  { id: 22, name: "المحكمة الابتدائية بمدنين", type: "ابتدائية" },
  { id: 23, name: "المحكمة الابتدائية بتطاوين", type: "ابتدائية" },
  { id: 24, name: "المحكمة الابتدائية بسيدي بوزيد", type: "ابتدائية" },
  { id: 25, name: "محكمة الاستئناف بتونس", type: "استئناف" },
  { id: 26, name: "محكمة الاستئناف بنابل", type: "استئناف" },
  { id: 27, name: "محكمة الاستئناف ببنزرت", type: "استئناف" },
  { id: 28, name: "محكمة الاستئناف بالقيروان", type: "استئناف" },
  { id: 29, name: "محكمة الاستئناف بصفاقس", type: "استئناف" },
  { id: 30, name: "محكمة الاستئناف بقفصة", type: "استئناف" },
  { id: 28, name: "محكمة الاستئناف بالقيروان", type: "استئناف" },
  { id: 29, name: "محكمة الاستئناف بصفاقس", type: "استئناف" },
  { id: 30, name: "محكمة الاستئناف بقفصة", type: "استئناف" },
  { id: 31, name: "محكمة الاستئناف بتونس", type: "استئناف" },
  { id: 32, name: "محكمة الاستئناف بسوسة", type: "استئناف" },
  { id: 33, name: "محكمة الاستئناف بالمنستير", type: "استئناف" },
  { id: 34, name: "محكمة الاستئناف بباجة", type: "استئناف" },
  { id: 35, name: "محكمة الاستئناف ببنزرت", type: "استئناف" },
  { id: 36, name: "محكمة الاستئناف بالقصرين", type: "استئناف" },
  { id: 37, name: "محكمة الاستئناف بقابس", type: "استئناف" },
  { id: 38, name: "محكمة الاستئناف بمدنين", type: "استئناف" },
  { id: 39, name: "محكمة الاستئناف بسيدي بوزيد", type: "استئناف" },
  { id: 40, name: "محكمة الناحية بتونس", type: "ناحية" },
  { id: 41, name: "محكمة الناحية بقرطاج", type: "ناحية" },
  { id: 42, name: "محكمة الناحية بباردو", type: "ناحية" },
  { id: 43, name: "محكمة الناحية تونس2 الزهور", type: "ناحية" },
  { id: 44, name: "محكمة الناحية بالوردية", type: "ناحية" },
  { id: 45, name: "محكمة الناحية بأريانة", type: "ناحية" },
  { id: 46, name: "محكمة الناحية بمنوبة", type: "ناحية" },
  { id: 47, name: "محكمة الناحية بنابل", type: "ناحية" },
  { id: 48, name: "محكمة الناحية ببنزرت", type: "ناحية" },
  { id: 49, name: "المحكمة الإدارية بتونس", type: "إدارية" },
  { id: 50, name: "المحكمة الإدارية بأريانة", type: "إدارية" },
  { id: 51, name: "المحكمة الإدارية بنعروس", type: "إدارية" },
  { id: 52, name: "المحكمة الإدارية بسوسة", type: "إدارية" },
  { id: 53, name: "المحكمة الإدارية بصفاقس", type: "إدارية" },
  { id: 54, name: "المحكمة العقارية بتونس", type: "عقارية" },
  { id: 55, name: "المحكمة العقارية ببنزرت", type: "عقارية" },
  { id: 56, name: "المحكمة العقارية بالقصرين", type: "عقارية" },
  { id: 57, name: "المحكمة العقارية بمدنين", type: "عقارية" },
  { id: 58, name: "المحكمة العقارية بسليانة", type: "عقارية" },
  { id: 59, name: "المحكمة العقارية بقابس", type: "عقارية" },
  { id: 60, name: "المحكمة الإدارية بالقيروان", type: "إدارية" },
];

const apiUrl = 'http://localhost:3000/api/tribinaux';

const sendPostRequests = async () => {
    try {
        for (const trib of tribunaux) {
            const record = {
                nom: trib.name,
                type: trib.type
            };

            const response = await fetch(apiUrl, {
                method: 'POST',
                headers: {
                    'Content-Type': 'application/json'
                },
                body: JSON.stringify(record)
            });

            if (!response.ok) {
                throw new Error(`HTTP error! status: ${response.status}`);
            }

            const data = await response.json();
            console.log('Response:', data);
        }
    } catch (error) {
        console.error('Error sending request:', error.message);
    }
};

 sendPostRequests();
